#####################################################################
#
# <スクリプト名>
# バックアップスクリプト
#
# <概要>
# 指定ディレクトリを他のディスクへコピーする
#
# <更新履歴>
# 20210906 - 新規作成
#
#####################################################################
#!/bin/bash

#####################################################################
## 事前設定
#####################################################################

# 現在の日時取得(yyyymmdd)
data=`date "+%Y%m%d"`


#####################################################################
## パラメーター設定　※修正箇所
#####################################################################

# 設定開始 >>>>>

# バックアップ元パーティション
backup_target_from=/<パーティションを指定>

# バックアップイメージ作成先ディレクトリ
backup_target_to=<イメージ保管先ディレクトリを指定>

# 世代管理数
age="2"

# 設定終了 <<<<<

# ログ見出し出力
echo "##### $start_time start dd_backup #####" | sudo tee -a ${log_FILE}


#####################################################################
## バックアップ処理
#####################################################################

# バックアップ処理
sudo dd if=${backup_target_from} bs=256M status=progress | gzip -c > ${backup_image}


#####################################################################
## 世代管理
#####################################################################

# 旧ディレクトリを削除する
sudo find ${backup_target_to}/[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9] | sort -rn | tail +${age} | sudo tee -a ${log_FILE}
sudo find ${backup_target_to}/[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9] | sort -rn | tail +${age} | xargs rm -rf


######################################################################
## 実行後処理
######################################################################

# スクリプト終了時刻(yyyy/mm/dd hh:mm:ss)を取得する
end_time=$(date '+%Y/%m/%d %T')

# ログ見出し出力
echo "###### $end_time end dd_backup ######" | sudo tee -a ${log_FILE}